Had to fix a few things in the terraform code, manually planned and applied: 

```
Terraform will perform the following actions:

  # aws_db_instance.release will be created
  + resource "aws_db_instance" "release" {
      + address                               = (known after apply)
      + allocated_storage                     = 10
      + allow_major_version_upgrade           = false
      + apply_immediately                     = (known after apply)
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = false
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 10
      + backup_window                         = "06:40-07:10"
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + db_subnet_group_name                  = "vpc-test-private"
      + deletion_protection                   = true
      + endpoint                              = (known after apply)
      + engine                                = "mysql"
      + engine_version                        = "5.7"
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = "storypointsrelease"
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t2.small"
      + kms_key_id                            = (known after apply)
      + license_model                         = (known after apply)
      + maintenance_window                    = "sun:05:54-sun:06:24"
      + max_allocated_storage                 = 20
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = "arn:aws:iam::596297932419:role/rds-monitoring-role"
      + multi_az                              = false
      + name                                  = "storypointsrelease"
      + option_group_name                     = "default:mysql-5-7"
      + parameter_group_name                  = "default.mysql5.7"
      + password                              = (sensitive value)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_type                          = "gp2"
      + tags                                  = {
          + "Name"        = "storypoints-release"
          + "application" = "story-points"
          + "contact"     = "parrtnerdevelopment@validity.com"
          + "environment" = "test"
          + "managedby"   = "terraform"
          + "project"     = "story-points"
          + "repo_name"   = "ReturnPath/story-points/"
          + "team"        = "partner development"
        }
      + timezone                              = (known after apply)
      + username                              = "storypoints_release"
      + vpc_security_group_ids                = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```